Feature: Промяна на статуса на задача

  Scenario:
    Given потребителя отваря екарана за промяна на статус на задача
    When системата приема името на задачата "Task"
    And системата приема името на потребителя "User"
    And системата приема статус "To do"
    And потребителя натиска бутона за промяна на статуса на задачата
    Then визуализира се съобщение за сменен статус "Статусът е променен успешно"

  Scenario:
    Given потребителя отваря екарана за промяна на статус на задача
    When системата приема името на задачата "Task"
    And системата приема името на потребителя "User"
    And системата приема статус "Review"
    And потребителя натиска бутона за промяна на статуса на задачата
    Then визуализира се съобщение за сменен статус "Статусът е променен успешно"

  Scenario:
    Given потребителя отваря екарана за промяна на статус на задача
    When системата приема името на задачата "Task"
    And системата приема името на потребителя "User"
    And системата приема статус "Done"
    And потребителя натиска бутона за промяна на статуса на задачата
    Then визуализира се съобщение за сменен статус "Статусът е променен успешно"

  Scenario:
    Given потребителя отваря екарана за промяна на статус на задача
    When системата приема името на потребителя "User"
    And системата приема статус "To do"
    And потребителя натиска бутона за промяна на статуса на задачата
    Then визуализира се съобщение за неуспешна смяна "Моля, посочете заглавие на задача"

  Scenario:
    Given потребителя отваря екарана за промяна на статус на задача
    When системата приема името на задачата "Task"
    And системата приема статус "To do"
    And потребителя натиска бутона за промяна на статуса на задачата
    Then визуализира се съобщение за неуспешна смяна "Моля, посочете име на потребител"

  Scenario:
    Given потребителя отваря екарана за промяна на статус на задача
    When системата приема името на задачата "Task"
    And системата приема името на потребителя "User"
    And потребителя натиска бутона за промяна на статуса на задачата
    Then визуализира се съобщение за неуспешна смяна "Моля, посочете статус"

  Scenario:
    Given потребителя отваря екарана за промяна на статус на задача
    When системата приема името на задачата "Task779"
    And системата приема името на потребителя "Task"
    And системата приема статус "To do"
    And потребителя натиска бутона за промяна на статуса на задачата
    Then визуализира се съобщение за неуспешна смяна "Задачата не е открита"

  Scenario:
    Given потребителя отваря екарана за промяна на статус на задача
    When системата приема името на задачата "Task"
    And системата приема името на потребителя "User778"
    And системата приема статус "To do"
    And потребителя натиска бутона за промяна на статуса на задачата
    Then визуализира се съобщение за неуспешна смяна "Потребителят не е открит"

  Scenario:
    Given потребителя отваря екарана за промяна на статус на задача
    When системата приема името на задачата "Task"
    And системата приема името на потребителя "User"
    And системата приема статус "Random"
    And потребителя натиска бутона за промяна на статуса на задачата
    Then визуализира се съобщение за неуспешна смяна "Статусът не е валиден"

  Scenario:
    Given потребителя отваря екарана за промяна на статус на задача
    When системата приема името на задачата "Task2"
    And системата приема името на потребителя "User"
    And системата приема статус "To do"
    And потребителя натиска бутона за промяна на статуса на задачата
    Then визуализира се съобщение за неуспешна смяна "Потребителя няма право да променя статусът"
