Feature: Създаване на проект

  Scenario:
    Given потребителя отваря екарана за създаване на проект
    When потребителя въвежда заглавие "Project70"
    And системата приема името на създателя "User"
    And потребителя натиска бутона за създаване на нов проект
    Then визуализира се съобщение за успех "Успешно създаден проект"

  Scenario:
    Given потребителя отваря екарана за създаване на проект
    When потребителя въвежда заглавие "Project70"
    And системата приема името на създателя "User"
    And потребителя въвежда описание "Това е нов проект"
    And потребителя натиска бутона за създаване на нов проект
    Then визуализира се съобщение за успех "Успешно създаден проект"

  Scenario:
    Given потребителя отваря екарана за създаване на проект
    When потребителя въвежда заглавие "Project70"
    And системата приема името на създателя "User"
    And потребителя въвежда описание "Това е нов проект"
    And потребителя въвежда крайна дата "2025-06-30 15:00"
    And потребителя натиска бутона за създаване на нов проект
    Then визуализира се съобщение за успех "Успешно създаден проект"

  Scenario:
    Given потребителя отваря екарана за създаване на проект
    When потребителя въвежда заглавие "Project70"
    And системата приема името на създателя "User"
    And потребителя въвежда крайна дата "2025-06-30 15:00"
    And потребителя натиска бутона за създаване на нов проект
    Then визуализира се съобщение за успех "Успешно създаден проект"

  Scenario:
    Given потребителя отваря екарана за създаване на проект
    When потребителя въвежда заглавие "Project70"
    And системата приема името на създателя "User99"
    And потребителя натиска бутона за създаване на нов проект
    Then визуализира се съобщение за неуспех "Потребителят не е открит"

  Scenario:
    Given потребителя отваря екарана за създаване на проект
    When системата приема името на създателя "User"
    And потребителя натиска бутона за създаване на нов проект
    Then визуализира се съобщение за неуспех "Моля, въведете заглавие"

  Scenario:
    Given потребителя отваря екарана за създаване на проект
    When потребителя въвежда заглавие "Project70"
    And потребителя натиска бутона за създаване на нов проект
    Then визуализира се съобщение за неуспех "Липсва потребителско име"

  Scenario:
    Given потребителя отваря екарана за създаване на проект
    When потребителя натиска бутона за създаване на нов проект
    Then визуализира се съобщение за неуспех "Липсват заглавие и потребителско име"

  Scenario:
    Given потребителя отваря екарана за създаване на проект
    When потребителя въвежда заглавие "Pr"
    And системата приема името на създателя "User"
    And потребителя натиска бутона за създаване на нов проект
    Then визуализира се съобщение за неуспех "Късо заглавие!!!"

  Scenario:
    Given потребителя отваря екарана за създаване на проект
    When потребителя въвежда заглавие "hfgbcvdeqwgdcvdsxadfvhrtreqwhfgbcvdeqwgdcvdsxadfvhrtreqwhfgbcvdeqwgdcvdsxadfvhrtreqwhfgbcvdeqwgdcvdsxadfvhrtreqw"
    And системата приема името на създателя "User"
    And потребителя натиска бутона за създаване на нов проект
    Then визуализира се съобщение за неуспех "Прекалено дълго заглавие!!!"

  Scenario:
    Given потребителя отваря екарана за създаване на проект
    When потребителя въвежда заглавие "Project70"
    And системата приема името на създателя "User"
    And потребителя въвежда описание "hfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfrhfgvbdscxasdwqerfdsxzcvfr"
    And потребителя натиска бутона за създаване на нов проект
    Then визуализира се съобщение за неуспех "Прекалено дълго описание!!!"

  Scenario:
    Given потребителя отваря екарана за създаване на проект
    When потребителя въвежда заглавие "Project70"
    And системата приема името на създателя "User"
    And потребителя въвежда крайна дата "1925-06-30 15:00"
    And потребителя натиска бутона за създаване на нов проект
    Then визуализира се съобщение за неуспех "Невалидна крайна дата"

  Scenario:
    Given потребителя отваря екарана за създаване на проект
    When потребителя въвежда заглавие "Project70"
    And системата приема името на създателя "User"
    And потребителя въвежда описание "Това е нов проект"
    And потребителя въвежда крайна дата "1925-06-30 15:00"
    And потребителя натиска бутона за създаване на нов проект
    Then визуализира се съобщение за неуспех "Невалидна крайна дата"